# TilePatternType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TilePattern..::..TilePatternType Property
TilePattern Class See Also
---
The built-in system tile pattern specified by this object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TilePatternsBuiltIn TilePatternType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TilePatternType As TilePatternsBuiltIn
	Get
```

Visual C++
---
```text
public:
property TilePatternsBuiltIn TilePatternType {
	TilePatternsBuiltIn get ();
}
```

# See Also
TilePattern Class
Autodesk.Revit.DB Namespace